# ПРЕДУПРЕЖДЕНИЕ: Этот тест ничего не хранит кроме кода. Поэтому не переживайте насчёт личных данных! :)
name = input ('Привет! Как тебя зовут? ')
age = int(input('А сколько тебе лет? '))
year = int(int(input('Напомнишь, какой сейчас год? ')))
hyear = (100 - age) + year
hyear1 = (100 - age) + (year - 1)
hby = year - age
hby1 = year - age - 1
print (f'Привет, {name}! Сейчас тебе {age}, ты родился(ась) в {hby}! Или в {hby1}? В любом случае, в {hyear}/{hyear1} году тебе исполнится 100 лет!')
print (f'А сейчас я скажу твоё имя наоборот:')
print (name[::-1])
print (f'Ну что, я удивил тебя? Надеюсь, да!')
# ------------------------------------------------ О Б Ъ Я С Н Е Н И Е -------------------------------------------------------------------------------
# Первые слова в первых 8 строк - название переменнных. После них - что делает переменная.                                                            |
# Дальше не могу объяснить, т. к. я сам новичок в этом направлении.                                                                                   |
# ------------------------------------------------ О Б Н О В Л Е Н И Я -------------------------------------------------------------------------------
# 1.0: (обновлено в 29.05.2023)                                                                                                                       |
#   Создан код                                                                                                                                        |
# 2.0: (обновлено в 29.05.2023)                                                                                                                       |
#   Глобально изменён код                                                                                                                             |
#   Созданы разделы: предупреждение, объяснение и обновления                                                                                          |
# ------------------------------------------------------ К О Н Е Ц -----------------------------------------------------------------------------------